balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA306.PIC
        <edc:SFRDef edc:access="----nnnnn---n-n-" edc:cname="PMD3" edc:desc="" edc:impl="0xf82" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000---0-0-" edc:name="PMD3" edc:nzwidth="0x10" edc:por="----00000---0-0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="I2C2MD" edc:desc="" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U3MD" edc:desc="" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMPMD" edc:desc="" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x1" edc:name="CMPMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXMMD" edc:desc="" edc:mask="0x1" edc:name="TXMMD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="CRCPMD" edc:desc="" edc:mask="0x1" edc:name="CRCPMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="DSMMD" edc:desc="" edc:mask="0x1" edc:name="DSMMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nn-nnn-" edc:cname="PMD4" edc:desc="" edc:impl="0x1e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00-000-" edc:name="PMD4" edc:nzwidth="0x10" edc:por="---------00-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LVDMD" edc:desc="" edc:mask="0x1" edc:name="LVDMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="REFOMD" edc:desc="" edc:mask="0x1" edc:name="REFOMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U4MD" edc:desc="" edc:mask="0x1" edc:name="U4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UPWMMD" edc:desc="" edc:mask="0x1" edc:name="UPWMMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---------n-----n" edc:cname="PMD6" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0-------0" edc:name="PMD6" edc:nzwidth="16" edc:por="-------0-------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI3MD" edc:desc="" edc:mask="0x1" edc:name="SPI3MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="LCDMD" edc:desc="" edc:mask="0x1" edc:name="LCDMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nn----" edc:cname="PMD7" edc:desc="" edc:impl="0x30" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------00----" edc:name="PMD7" edc:nzwidth="16" edc:por="----------00----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DMA0MD" edc:desc="" edc:mask="0x1" edc:name="DMA0MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DMA1MD" edc:desc="" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="128"/>
      </edc:SFRDataSector>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="CTED4"/>
      <edc:VirtualPin edc:name="LCDBIAS2"/>
      <edc:VirtualPin edc:name="CN63"/>
      <edc:VirtualPin edc:name="RE5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="LCDBIAS1"/>
      <edc:VirtualPin edc:name="CN64"/>
      <edc:VirtualPin edc:name="RE6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="LCDBIAS0"/>
      <edc:VirtualPin edc:name="CN65"/>
      <edc:VirtualPin edc:name="RE7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="RP21"/>
      <edc:VirtualPin edc:name="SEG0"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="RG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="VLCAP1"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="RP26"/>
      <edc:VirtualPin edc:name="PMA4"/>
      <edc:VirtualPin edc:name="CN9"/>
      <edc:VirtualPin edc:name="RG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="VLCAP2"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="RP19"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="CN10"/>
      <edc:VirtualPin edc:name="RG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="RP27"/>
      <edc:VirtualPin edc:name="SEG1"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="RG9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="RP18"/>
      <edc:VirtualPin edc:name="SEG2"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="RP28"/>
      <edc:VirtualPin edc:name="SEG3"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="SEG4"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="CTCMP"/>
      <edc:VirtualPin edc:name="CTED13"/>
      <edc:VirtualPin edc:name="RP13"/>
      <edc:VirtualPin edc:name="SEG5"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="CVREF-"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="RP1"/>
      <edc:VirtualPin edc:name="SEG6"/>
      <edc:VirtualPin edc:name="CTED12"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="CVREF+"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="RP0"/>
      <edc:VirtualPin edc:name="SEG7"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="RP6"/>
      <edc:VirtualPin edc:name="LCDBIAS3"/>
      <edc:VirtualPin edc:name="CN24"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RP7"/>
      <edc:VirtualPin edc:name="CN25"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="RP8"/>
      <edc:VirtualPin edc:name="SEG31"/>
      <edc:VirtualPin edc:name="COM7"/>
      <edc:VirtualPin edc:name="CN26"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="RP9"/>
      <edc:VirtualPin edc:name="SEG30"/>
      <edc:VirtualPin edc:name="COM6"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="CN27"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="CVREF"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="SEG29"/>
      <edc:VirtualPin edc:name="COM5"/>
      <edc:VirtualPin edc:name="PMA13"/>
      <edc:VirtualPin edc:name="CN28"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="PMA12"/>
      <edc:VirtualPin edc:name="CN29"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="PMA11"/>
      <edc:VirtualPin edc:name="SEG18"/>
      <edc:VirtualPin edc:name="CN30"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="SEG19"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="PMA10"/>
      <edc:VirtualPin edc:name="CN31"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="RP14"/>
      <edc:VirtualPin edc:name="SEG8"/>
      <edc:VirtualPin edc:name="CTED5"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="CN32"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="RP29"/>
      <edc:VirtualPin edc:name="SEG9"/>
      <edc:VirtualPin edc:name="CTED6"/>
      <edc:VirtualPin edc:name="REFO"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="RP10"/>
      <edc:VirtualPin edc:name="SDA2"/>
      <edc:VirtualPin edc:name="SEG10"/>
      <edc:VirtualPin edc:name="PMA9"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="RF4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="PMA8"/>
      <edc:VirtualPin edc:name="RP17"/>
      <edc:VirtualPin edc:name="SCL2"/>
      <edc:VirtualPin edc:name="SEG11"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="RF5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RP16"/>
      <edc:VirtualPin edc:name="SEG12"/>
      <edc:VirtualPin edc:name="CN71"/>
      <edc:VirtualPin edc:name="RF3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="RP30"/>
      <edc:VirtualPin edc:name="CN70"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="CN84"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="SEG47"/>
      <edc:VirtualPin edc:name="CN73"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="SEG28"/>
      <edc:VirtualPin edc:name="CN72"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="OSCI"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RC12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="OSCO"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="RP2"/>
      <edc:VirtualPin edc:name="SEG13"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="OCTRIG1"/>
      <edc:VirtualPin edc:name="CN53"/>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RP4"/>
      <edc:VirtualPin edc:name="SEG14"/>
      <edc:VirtualPin edc:name="PMACK2"/>
      <edc:VirtualPin edc:name="CN54"/>
      <edc:VirtualPin edc:name="RD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RP3"/>
      <edc:VirtualPin edc:name="SEG15"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="C3IND"/>
      <edc:VirtualPin edc:name="CS2"/>
      <edc:VirtualPin edc:name="CN55"/>
      <edc:VirtualPin edc:name="RD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="RP12"/>
      <edc:VirtualPin edc:name="C3INC"/>
      <edc:VirtualPin edc:name="SEG16"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="CS1"/>
      <edc:VirtualPin edc:name="CN56"/>
      <edc:VirtualPin edc:name="RD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="RP11"/>
      <edc:VirtualPin edc:name="SEG17"/>
      <edc:VirtualPin edc:name="CN49"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="RPI37"/>
      <edc:VirtualPin edc:name="SCKLI"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="RP24"/>
      <edc:VirtualPin edc:name="SEG20"/>
      <edc:VirtualPin edc:name="CN50"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RP23"/>
      <edc:VirtualPin edc:name="SEG21"/>
      <edc:VirtualPin edc:name="PMACK1"/>
      <edc:VirtualPin edc:name="CN51"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RP22"/>
      <edc:VirtualPin edc:name="SEG22"/>
      <edc:VirtualPin edc:name="PMBE0"/>
      <edc:VirtualPin edc:name="CN52"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RP25"/>
      <edc:VirtualPin edc:name="SEG23"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RP20"/>
      <edc:VirtualPin edc:name="SEG24"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="C3INB"/>
      <edc:VirtualPin edc:name="SEG25"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="C3INA"/>
      <edc:VirtualPin edc:name="SEG26"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="VCAP"/>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="SEG27"/>
      <edc:VirtualPin edc:name="CN68"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="COM4"/>
      <edc:VirtualPin edc:name="SEG48"/>
      <edc:VirtualPin edc:name="CN69"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="COM3"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="CN58"/>
      <edc:VirtualPin edc:name="RE0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="COM2"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="CN59"/>
      <edc:VirtualPin edc:name="RE1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="COM1"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="CN60"/>
      <edc:VirtualPin edc:name="RE2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="COM0"/>
      <edc:VirtualPin edc:name="CTED9"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="CN61"/>
      <edc:VirtualPin edc:name="RE3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="CTED8"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="CN62"/>
      <edc:VirtualPin edc:name="RE4"/>
    </edc:Pin>
